Hi Fred,

I had replaced the "SitePolicies" with type = "DeliveryGroupPolicies" in the script.

Output of 'terraform apply' shows the resource got created and same can be seen in the Citrix Studio Common Tasks, however, these doesn't shows up in the Citrix Studio Policies.

![Image](https://github.com/user-attachments/assets/a6b18b70-bb2e-4c43-a3d1-207a3f980138)

Attached the TF_LOG file "citrix-provider-issue.txt" for your reference:

[citrix-provider-issue.txt](https://github.com/user-attachments/files/18891337/citrix-provider-issue.txt)

Terraform Apply Output:

terraform apply -auto-approve
[0m[1mdata.citrix_delivery_group.xaview_dg_0: Reading...[0m[0m
[0m[1mdata.citrix_delivery_group.xaview_dg_0: Read complete after 1s [id=5c9df471-ad04-4dc5-a373-
61e7eae33ba4][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # citrix_policy_set.example-policy-set-011[0m will be created
[0m  [32m+[0m[0m resource "citrix_policy_set" "example-policy-set-011" {
      [32m+[0m[0m assigned        = (known after apply)
      [32m+[0m[0m delivery_groups = []
      [32m+[0m[0m description     = "This is an example policy set description"
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = "example-policy-set-011"
      [32m+[0m[0m policies        = [
          [32m+[0m[0m {
              [32m+[0m[0m access_control_filters      = (known after apply)
              [32m+[0m[0m client_ip_filters           = (known after apply)
              [32m+[0m[0m client_name_filters         = (known after apply)
              [32m+[0m[0m delivery_group_filters      = [
                  [32m+[0m[0m {
                      [32m+[0m[0m allowed           = true
                      [32m+[0m[0m delivery_group_id = "5c9df471-ad04-4dc5-a373-61e7eae33ba4"
                      [32m+[0m[0m enabled           = true
                      [32m+[0m[0m id                = (known after apply)
                    },
                ]
              [32m+[0m[0m delivery_group_type_filters = (known after apply)
              [32m+[0m[0m description                 = "Test policy in the example policy set w
ith priority 0"
              [32m+[0m[0m enabled                     = true
              [32m+[0m[0m id                          = (known after apply)
              [32m+[0m[0m name                        = "test-policy-with-priority-011"
              [32m+[0m[0m ou_filters                  = (known after apply)
              [32m+[0m[0m policy_settings             = [
                  [32m+[0m[0m {
                      [32m+[0m[0m name        = "AdvanceWarningPeriod"
                      [32m+[0m[0m use_default = false
                      [32m+[0m[0m value       = "13:00:00"
                    },
                ]
              [32m+[0m[0m tag_filters                 = (known after apply)
              [32m+[0m[0m user_filters                = (known after apply)
            },
          [32m+[0m[0m {
              [32m+[0m[0m access_control_filters      = (known after apply)
              [32m+[0m[0m client_ip_filters           = (known after apply)
              [32m+[0m[0m client_name_filters         = (known after apply)
              [32m+[0m[0m delivery_group_filters      = (known after apply)
              [32m+[0m[0m delivery_group_type_filters = (known after apply)
              [32m+[0m[0m description                 = "Test policy in the example policy set w
ith priority 012"
              [32m+[0m[0m enabled                     = false
              [32m+[0m[0m id                          = (known after apply)
              [32m+[0m[0m name                        = "test-policy-with-priority-012"
              [32m+[0m[0m ou_filters                  = (known after apply)
              [32m+[0m[0m policy_settings             = []
              [32m+[0m[0m tag_filters                 = (known after apply)
              [32m+[0m[0m user_filters                = (known after apply)
            },
        ]
      [32m+[0m[0m scopes          = []
      [32m+[0m[0m type            = "DeliveryGroupPolicies"
    }

[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m[0m[1mcitrix_policy_set.example-policy-set-011: Creating...[0m[0m
[0m[1mcitrix_policy_set.example-policy-set-011: Still creating... [10s elapsed][0m[0m
[0m[1mcitrix_policy_set.example-policy-set-011: Still creating... [20s elapsed][0m[0m
[0m[1mcitrix_policy_set.example-policy-set-011: Still creating... [30s elapsed][0m[0m
[0m[1mcitrix_policy_set.example-policy-set-011: Creation complete after 32s [id=e61f6e8c-a42c-4e6
2-91a1-74d2dd2ce6e9][0m
[0m[1m[32m
Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
[0m[0m[1m[32m
Outputs:

[0mdelivery_group_0_output = "5c9df471-ad04-4dc5-a373-61e7eae33ba4"



Thanks,
Ravi